In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame([[1,   np.nan,  2],
               [2,      3,      5],
               [np.nan,  4,     6]])
df
df.dropna()

     0    1  2
1  2.0  3.0  5

In [2]:
data=pd.Series([1,np.nan,2,None,3],index=list('agced'))
data

a    1.0
g    NaN
c    2.0
e    NaN
d    3.0
dtype: float64

In [4]:
data.fillna(0)

a    1.0
g    0.0
c    2.0
e    0.0
d    3.0
dtype: float64

In [5]:
data.fillna(method='ffill')

a    1.0
g    1.0
c    2.0
e    2.0
d    3.0
dtype: float64

In [6]:
import missingno as msno
import matplotlib.pyplot as plt 
import pandas as pd

In [ ]:
df=pd.read_csv('diab.csv',header=None)
msno.matrix(df)
plt.show()

In [ ]:
msno.bar(df)
plt.show()

In [7]:
import numpy as np
df=pd.DataFrame({'value':np.random.randint(0,100,20)})
print(df)

    value
0      13
1      37
2      43
3      50
4      63
5      51
6       4
7      50
8      53
9      72
10     25
11      1
12     50
13     42
14     22
15     77
16     85
17     29
18     23
19     61

In [8]:
labels=["{0}-{1}".format(i,i+9) for i in range(0,100,10)]
print(labels)

['0-9', '10-19', '20-29', '30-39', '40-49', '50-59', '60-69', '70-79', '80-89', '90-99']

In [10]:
df["group"]=pd.cut(df.value,range(0,105,10),right=False,
                 labels=labels)
print(df['group'])

0     10-19
1     30-39
2     40-49
3     50-59
4     60-69
5     50-59
6       0-9
7     50-59
8     50-59
9     70-79
10    20-29
11      0-9
12    50-59
13    40-49
14    20-29
15    70-79
16    80-89
17    20-29
18    20-29
19    60-69
Name: group, dtype: category
Categories (10, object): [0-9 < 10-19 < 20-29 < 30-39 ... 60-69 < 70-79 < 80-89 < 90-99]

In [13]:
import pandas as pd
raw_cat=pd.Categorical(['a','b','c','a'],categories=
                      ['b','c','d'],ordered=False)
raw_cat

[NaN, b, c, NaN]
Categories (3, object): [b, c, d]

In [18]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],
                'data1':range(6)})
df
pd.get_dummies(df["key"])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [19]:
from pandas import Series,DataFrame
df1=DataFrame({'key':['b','b','a','c','a','a','b'],
               'data1':range(7)})
print(df1)

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [20]:
df2=DataFrame({'key':['a','b','d'],'data2':range(3)})
print(df2)

  key  data2
0   a      0
1   b      1
2   d      2

In [21]:
print(pd.merge(df1,df2,how='inner'))

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [22]:
print(pd.merge(df1,df2,on='key'))

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [24]:
print(pd.merge(df1,df2,left_on='key',right_on='key'))

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [27]:
print(pd.merge(df1,df2,how='outer'))

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [32]:
data=DataFrame(np.arange(6).reshape(2,3),columns=pd.Index(['one','two','three'],name='number'),
 index=pd.Index(['Ohio','Colorado'],name='state'))
print(data)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [33]:
result=data.stack()   #왜 하는 거지?
print('분리')

분리

In [34]:
print(result)

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [35]:
print(result.unstack())

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [36]:
data=pd.DataFrame({'k1':['one']*3+['two']*4,'k2':[1,1,2,3,3,4,4]})
print(data)

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [37]:
print('중복')

중복

In [38]:
print(data.duplicated())

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [39]:
print(data.drop_duplicates())

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [40]:
data['v1']=range(7)
print(data)

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [42]:
data=data.drop_duplicates()
data

    k1  k2  v1
0  one   1   0
1  one   1   1
2  one   2   2
3  two   3   3
4  two   3   4
5  two   4   5
6  two   4   6

In [43]:
data.drop_duplicates(['k1','k2'])

    k1  k2  v1
0  one   1   0
2  one   2   2
3  two   3   3
5  two   4   5

In [ ]:
data.drop_duplicates('k')

In [44]:
data=Series([1.,-999.,2.,-999.,-1000.,3.])
print(data)

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [49]:
print('일정데이터를 nan으로 ',data.replace(-999,np.nan),end=",")

일정데이터를 nan으로  0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64,

In [51]:
print('짝으로',data.replace([-999,-1000],[np.nan,0]))

짝으로 0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [52]:
print(data.replace({-999:np.nan,-1000:0}))

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [55]:
data=DataFrame(np.arange(12).reshape((3,4)),
               index=['Ohio','Colorado','New York'],
              columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [61]:
data.dtypes

one      int32
two      int32
three    int32
four     int32
dtype: object

In [56]:
#index 
#data.columns.upper()
data.index=data.index.map(str.upper)
data

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

In [65]:
data.rename(index=str.title,columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [66]:
data.rename(columns={'three':'peekaboo'})

          one  two  peekaboo  four
OHIO        0    1         2     3
COLORADO    4    5         6     7
NEW YORK    8    9        10    11

In [67]:
age=[20,22,25,27,21,24,37,31,61,45,41,32]

In [69]:
bins=[18,25,35,60,100]
cats=pd.cut(age,bins)
print('범주화한 데이터',cats)

범주화한 데이터 [(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
print('code',cats.codes)
print('범주의 종류는',cats.categories)
print('범주별로 카운터 한결과',pd.value_counts(cats))

code [0 0 0 1 0 0 2 1 3 2 2 1]
범주의 종류는 IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')
범주별로 카운터 한결과 (18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
olive=pd.read_csv('olive.csv')
olive
olive.dtypes
print(olive.dtypes)
olive.describe()

In [ ]:
olive.rename(columns={olive.columns[0]:'ID_area',inplace=True})

In [ ]:
olive.region.uniaue()
olive.region.unuque()
pd.crosstab(olive.area,olive.region)

In [ ]:
olive['ID_area']=olive['ID_area'].apply(lambda x:x.split('.')[1])

In [ ]:
acidict=['palmitic','palmitic','stearic','oleic','linolinic','linolenic','arachidic','eicosenoic']
olivesub=olive[acidict]

In [ ]:
olivesub=olive[acidict].apply(lambda x :x/100)
olive[acidict]=olivesub

In [ ]:
fig=plt.fiugre()
plt.scatter(olive['palitic'],olive['linolenic'])
axis=fig.gca()
axis.set_title('')
axis.set_xlabel()
axis.set_ylabel()

In [ ]:
region_groupby=olive.groupby(['region'])

In [ ]:
region_grouby.apply(np.mean)
region_grouby.apply(lambda x : x.mean())
region_grouby.describe()